In [1]:
import pandas as pd
import numpy as np

In [2]:
f_2015 = pd.read_csv('./data/Fortune_500_2015.csv', usecols=['rank','company'])
f_2016 = pd.read_csv('./data/Fortune_500_2016.csv', usecols=['rank','company'])

In [3]:
companies_15_16 = f_2015.merge(f_2016, how='inner', on='company', suffixes=['_2015','_2016'])
companies_15_16.head()

   rank_2015             company  rank_2016
0          1             Walmart          1
1          2         Exxon Mobil          2
2          3             Chevron         14
3          4  Berkshire Hathaway          4
4          5               Apple          3

In [4]:
microsoft = companies_15_16['company'] == 'Microsoft'
companies_15_16.loc[microsoft]

    rank_2015    company  rank_2016
30         31  Microsoft         25

In [12]:
companies_15_16 = f_2015.merge(f_2016, how='outer', on='company', suffixes=['_2015','_2016'], indicator=True)
companies_15_16

     rank_2015                   company  rank_2016      _merge
0          1.0                   Walmart        1.0        both
1          2.0               Exxon Mobil        2.0        both
2          3.0                   Chevron       14.0        both
3          4.0        Berkshire Hathaway        4.0        both
4          5.0                     Apple        3.0        both
..         ...                       ...        ...         ...
529        NaN  Telephone & Data Systems      496.0  right_only
530        NaN  First American Financial      497.0  right_only
531        NaN                       NVR      498.0  right_only
532        NaN      Cincinnati Financial      499.0  right_only
533        NaN         Burlington Stores      500.0  right_only

[534 rows x 4 columns]

In [13]:
filter_right = companies_15_16['_merge'] == 'right_only'
filter_left = companies_15_16['_merge'] == 'left_only'

In [14]:
right = companies_15_16[filter_right]
left = companies_15_16[filter_left]

In [15]:
filter_right

0      False
1      False
2      False
3      False
4      False
       ...
529     True
530     True
531     True
532     True
533     True
Name: _merge, Length: 534, dtype: bool

In [18]:
right.head()

     rank_2015                 company  rank_2016      _merge
500        NaN                 Arconic      126.0  right_only
501        NaN             Kraft Heinz      153.0  right_only
502        NaN  Performance Food Group      185.0  right_only
503        NaN   Hertz Global Holdings      269.0  right_only
504        NaN         PayPal Holdings      307.0  right_only

In [19]:
left.head()

     rank_2015                  company  rank_2016     _merge
83        84.0                  Safeway        NaN  left_only
94        95.0                  DirecTV        NaN  left_only
124      125.0                    Alcoa        NaN  left_only
164      165.0                    Kraft        NaN  left_only
174      175.0  TRW Automotive Holdings        NaN  left_only